const { getDebugName } = require("mobx");

let json = {
    "state": "T",
    "data": {
        "GHLIST": {
            "GH": [
                {
                    "DJH": "V0172804",
                    "HL": "专科",
                    "YYSJ": "2021-03-02 08:57:49",
                    "KDKS": "全科医学科专科门诊",
                    "DJLX": 4,
                    "ZXZT": "完成就诊",
                    "SFYY": 0,
                    "JE": 5.5,
                    "YSID": 1817,
                    "YSXM": "王会华",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": {
                        "YZ": [
                            {
                                "@医嘱ID": "148720018",
                                "YZID": 148720018,
                                "YZLX": "检验",
                                "YZMC": "葡萄糖测定",
                                "FMLIST": {
                                    "FM": [
                                        {
                                            "MC": "检验费",
                                            "JE": 4,
                                            "ZFZT": 1,
                                            "MXLIST": {
                                                "MX": {
                                                    "MC": "葡萄糖测定(其他方法)",
                                                    "GG": "",
                                                    "SL": 1,
                                                    "DW": "项",
                                                    "DJ": 4
                                                }
                                            }
                                        },
                                        {
                                            "MC": "治疗费",
                                            "JE": 6,
                                            "ZFZT": 1,
                                            "MXLIST": {
                                                "MX": {
                                                    "MC": "静脉注射器采血",
                                                    "GG": "",
                                                    "SL": 1,
                                                    "DW": "次",
                                                    "DJ": 6
                                                }
                                            }
                                        }
                                    ]
                                },
                                "DJLIST": {
                                    "DJ": [
                                        {
                                            "DJH": "V0545297",
                                            "DJLX": 1,
                                            "JE": 4,
                                            "KDSJ": "2021-03-02 09:08:57",
                                            "ZFZT": 1,
                                            "YTJE": 0,
                                            "JYLSH": "TFSSGZH_JFZT_210302090547_853052V0545297",
                                            "SFJSK": 1
                                        },
                                        {
                                            "DJH": "V0545298",
                                            "DJLX": 1,
                                            "JE": 6,
                                            "KDSJ": "2021-03-02 09:11:20",
                                            "ZFZT": 1,
                                            "YTJE": 0,
                                            "JYLSH": "TFSSGZH_JFZT_210302090812_864458V0545298",
                                            "SFJSK": 1
                                        }
                                    ]
                                }
                            },
                            {
                                "@医嘱ID": "148750291",
                                "YZID": 148750291,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 11.09,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "连花清瘟胶囊",
                                                "GG": "0.35g*24粒",
                                                "SL": 24,
                                                "DW": "粒",
                                                "DJ": ".4621"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0551308",
                                        "DJLX": 1,
                                        "JE": 11.09,
                                        "KDSJ": "2021-03-02 14:51:06",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210302144755_560770V0551308",
                                        "SFJSK": 1
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "DJH": "V0173836",
                    "HL": "普通",
                    "YYSJ": "2021-03-02 10:56:06",
                    "KDKS": "妇科普通门诊",
                    "DJLX": 4,
                    "ZXZT": "完成就诊",
                    "SFYY": 0,
                    "JE": 5,
                    "YSID": 2129,
                    "YSXM": "卢安清",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": ""
                },
                {
                    "DJH": "V0176095",
                    "HL": "普通",
                    "YYSJ": "2021-03-03 08:50:23",
                    "KDKS": "耳鼻咽喉科普通门诊",
                    "DJLX": 4,
                    "ZXZT": "正在就诊",
                    "SFYY": 0,
                    "JE": 5,
                    "YSID": 6247,
                    "YSXM": "李文仙",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": {
                        "YZ": [
                            {
                                "@医嘱ID": "148786877",
                                "YZID": 148786877,
                                "YZLX": "检验",
                                "YZMC": "血常规24项（门诊）",
                                "FMLIST": {
                                    "FM": [
                                        {
                                            "MC": "检验费",
                                            "JE": 24,
                                            "ZFZT": 1,
                                            "MXLIST": {
                                                "MX": {
                                                    "MC": "血细胞分析",
                                                    "GG": "",
                                                    "SL": 24,
                                                    "DW": "项",
                                                    "DJ": 1
                                                }
                                            }
                                        },
                                        {
                                            "MC": "治疗费",
                                            "JE": 6,
                                            "ZFZT": 1,
                                            "MXLIST": {
                                                "MX": {
                                                    "MC": "静脉注射器采血",
                                                    "GG": "",
                                                    "SL": 1,
                                                    "DW": "次",
                                                    "DJ": 6
                                                }
                                            }
                                        }
                                    ]
                                },
                                "DJLIST": {
                                    "DJ": [
                                        {
                                            "DJH": "V0559561",
                                            "DJLX": 1,
                                            "JE": 24,
                                            "KDSJ": "2021-03-03 09:22:15",
                                            "ZFZT": 1,
                                            "YTJE": 0,
                                            "JYLSH": "TFSSGZH_JFZT_210303091901_665692V0559561",
                                            "SFJSK": 1
                                        },
                                        {
                                            "DJH": "V0559562",
                                            "DJLX": 1,
                                            "JE": 6,
                                            "KDSJ": "2021-03-03 09:22:14",
                                            "ZFZT": 1,
                                            "YTJE": 0,
                                            "JYLSH": "TFSSGZH_JFZT_210303091901_665692V0559562",
                                            "SFJSK": 1
                                        }
                                    ]
                                }
                            },
                            {
                                "@医嘱ID": "148800959",
                                "YZID": 148800959,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 11.09,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "连花清瘟胶囊",
                                                "GG": "0.35g*24粒",
                                                "SL": 24,
                                                "DW": "粒",
                                                "DJ": ".4621"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0561730",
                                        "DJLX": 1,
                                        "JE": 11.09,
                                        "KDSJ": "2021-03-03 10:33:24",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210303103012_204066V0561730",
                                        "SFJSK": 1
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "DJH": "V0179395",
                    "HL": "普通",
                    "YYSJ": "2021-03-04 08:54:43",
                    "KDKS": "神经外科普通门诊",
                    "DJLX": 4,
                    "ZXZT": "完成就诊",
                    "SFYY": 0,
                    "JE": 5,
                    "YSID": 436,
                    "YSXM": "王仁菊",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": {
                        "YZ": {
                            "@医嘱ID": "148853235",
                            "YZID": 148853235,
                            "YZLX": "检验",
                            "YZMC": "",
                            "FMLIST": {
                                "FM": {
                                    "MC": "检验费",
                                    "JE": 30,
                                    "ZFZT": 1,
                                    "MXLIST": {
                                        "MX": [
                                            {
                                                "MC": "尿液分析",
                                                "GG": "",
                                                "SL": 1,
                                                "DW": "次",
                                                "DJ": 10
                                            },
                                            {
                                                "MC": "尿沉渣定量",
                                                "GG": "",
                                                "SL": 4,
                                                "DW": "项",
                                                "DJ": 5
                                            }
                                        ]
                                    }
                                }
                            },
                            "DJLIST": {
                                "DJ": {
                                    "DJH": "V0572834",
                                    "DJLX": 1,
                                    "JE": 30,
                                    "KDSJ": "2021-03-04 09:45:33",
                                    "ZFZT": 1,
                                    "YTJE": 0,
                                    "JYLSH": "TFSSGZH_JFZT_210304094215_103580",
                                    "SFJSK": 1
                                }
                            }
                        }
                    }
                },
                {
                    "DJH": "V0182415",
                    "HL": "普通",
                    "YYSJ": "2021-03-05 08:51:39",
                    "KDKS": "内分泌科普通门诊",
                    "DJLX": 4,
                    "ZXZT": "完成就诊",
                    "SFYY": 0,
                    "JE": 5,
                    "YSID": 1812,
                    "YSXM": "胡娅娜",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": {
                        "YZ": [
                            {
                                "@医嘱ID": "148906876",
                                "YZID": 148906876,
                                "YZLX": "检验",
                                "YZMC": "葡萄糖测定",
                                "FMLIST": {
                                    "FM": [
                                        {
                                            "MC": "检验费",
                                            "JE": 4,
                                            "ZFZT": 1,
                                            "MXLIST": {
                                                "MX": {
                                                    "MC": "葡萄糖测定(其他方法)",
                                                    "GG": "",
                                                    "SL": 1,
                                                    "DW": "项",
                                                    "DJ": 4
                                                }
                                            }
                                        },
                                        {
                                            "MC": "治疗费",
                                            "JE": 6,
                                            "ZFZT": 1,
                                            "MXLIST": {
                                                "MX": {
                                                    "MC": "静脉注射器采血",
                                                    "GG": "",
                                                    "SL": 1,
                                                    "DW": "次",
                                                    "DJ": 6
                                                }
                                            }
                                        }
                                    ]
                                },
                                "DJLIST": {
                                    "DJ": [
                                        {
                                            "DJH": "V0583900",
                                            "DJLX": 1,
                                            "JE": 4,
                                            "KDSJ": "2021-03-05 09:17:34",
                                            "ZFZT": 1,
                                            "YTJE": 0,
                                            "JYLSH": "TFSSGZH_JFZT_210305091416_023367",
                                            "SFJSK": 1
                                        },
                                        {
                                            "DJH": "V0583901",
                                            "DJLX": 1,
                                            "JE": 6,
                                            "KDSJ": "2021-03-05 13:53:10",
                                            "ZFZT": 1,
                                            "YTJE": 0,
                                            "JYLSH": "TFSSGZH_JFZT_210305135000_193899",
                                            "SFJSK": 1
                                        }
                                    ]
                                }
                            },
                            {
                                "@医嘱ID": "148909558",
                                "YZID": 148909558,
                                "YZLX": "检验",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "检验费",
                                        "JE": 30,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": [
                                                {
                                                    "MC": "尿液分析",
                                                    "GG": "",
                                                    "SL": 1,
                                                    "DW": "次",
                                                    "DJ": 10
                                                },
                                                {
                                                    "MC": "尿沉渣定量",
                                                    "GG": "",
                                                    "SL": 4,
                                                    "DW": "项",
                                                    "DJ": 5
                                                }
                                            ]
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0584387",
                                        "DJLX": 1,
                                        "JE": 30,
                                        "KDSJ": "2021-03-05 13:53:10",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210305135000_375597",
                                        "SFJSK": 1
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "DJH": "V0186395",
                    "HL": "普通",
                    "YYSJ": "2021-03-06 11:09:34",
                    "KDKS": "重症医学科普通门诊",
                    "DJLX": 4,
                    "ZXZT": "等待就诊",
                    "SFYY": 0,
                    "JE": 5.5,
                    "YSID": 1812,
                    "YSXM": "",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": ""
                },
                {
                    "DJH": "V0186975",
                    "HL": "专科",
                    "YYSJ": "2021-03-06 14:32:05",
                    "KDKS": "普通外科",
                    "DJLX": 4,
                    "ZXZT": "完成就诊",
                    "SFYY": 0,
                    "JE": 5.5,
                    "YSID": 5074,
                    "YSXM": "蒋睿",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": {
                        "YZ": [
                            {
                                "@医嘱ID": "148987508",
                                "YZID": 148987508,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 1.73,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "阿莫西林胶囊",
                                                "GG": "0.25g*24粒",
                                                "SL": 24,
                                                "DW": "粒",
                                                "DJ": ".0721"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0599890",
                                        "DJLX": 1,
                                        "JE": 12.82,
                                        "KDSJ": "2021-03-06 14:50:56",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210306144743_366219",
                                        "SFJSK": 1
                                    }
                                }
                            },
                            {
                                "@医嘱ID": "148987510",
                                "YZID": 148987510,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 11.09,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "连花清瘟胶囊",
                                                "GG": "0.35g*24粒",
                                                "SL": 24,
                                                "DW": "粒",
                                                "DJ": ".4621"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0599890",
                                        "DJLX": 1,
                                        "JE": 12.82,
                                        "KDSJ": "2021-03-06 14:50:56",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210306144743_366219",
                                        "SFJSK": 1
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "DJH": "V0190518",
                    "HL": "专科",
                    "YYSJ": "2021-03-08 08:45:05",
                    "KDKS": "皮肤科普通门诊",
                    "DJLX": 4,
                    "ZXZT": "完成就诊",
                    "SFYY": 0,
                    "JE": 5.5,
                    "YSID": 6767,
                    "YSXM": "冯荣芝",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": {
                        "YZ": [
                            {
                                "@医嘱ID": "149050945",
                                "YZID": 149050945,
                                "YZLX": "检验",
                                "YZMC": "葡萄糖测定",
                                "FMLIST": {
                                    "FM": [
                                        {
                                            "MC": "检验费",
                                            "JE": 4,
                                            "ZFZT": 1,
                                            "MXLIST": {
                                                "MX": {
                                                    "MC": "葡萄糖测定(其他方法)",
                                                    "GG": "",
                                                    "SL": 1,
                                                    "DW": "项",
                                                    "DJ": 4
                                                }
                                            }
                                        },
                                        {
                                            "MC": "治疗费",
                                            "JE": 6,
                                            "ZFZT": 1,
                                            "MXLIST": {
                                                "MX": {
                                                    "MC": "静脉注射器采血",
                                                    "GG": "",
                                                    "SL": 1,
                                                    "DW": "次",
                                                    "DJ": 6
                                                }
                                            }
                                        }
                                    ]
                                },
                                "DJLIST": {
                                    "DJ": [
                                        {
                                            "DJH": "V0611128",
                                            "DJLX": 1,
                                            "JE": 4,
                                            "KDSJ": "2021-03-08 10:01:23",
                                            "ZFZT": 1,
                                            "YTJE": 0,
                                            "JYLSH": "TFSSGZH_JFZT_210308095805_598226",
                                            "SFJSK": 1
                                        },
                                        {
                                            "DJH": "V0611129",
                                            "DJLX": 1,
                                            "JE": 6,
                                            "KDSJ": "2021-03-08 10:01:23",
                                            "ZFZT": 1,
                                            "YTJE": 0,
                                            "JYLSH": "TFSSGZH_JFZT_210308095805_902194",
                                            "SFJSK": 1
                                        }
                                    ]
                                }
                            },
                            {
                                "@医嘱ID": "149071460",
                                "YZID": 149071460,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 20.96,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "丁酸氢化可的松乳膏",
                                                "GG": "0.1％*30g",
                                                "SL": 1,
                                                "DW": "盒",
                                                "DJ": 20.96
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0615819",
                                        "DJLX": 1,
                                        "JE": 20.96,
                                        "KDSJ": "2021-03-08 11:18:55",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "",
                                        "SFJSK": 0
                                    }
                                }
                            },
                            {
                                "@医嘱ID": "149082308",
                                "YZID": 149082308,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 21.38,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "复合乳酸菌肠溶胶囊",
                                                "GG": "0.33g*12粒",
                                                "SL": 12,
                                                "DW": "粒",
                                                "DJ": 1.7817
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0617711",
                                        "DJLX": 1,
                                        "JE": 21.38,
                                        "KDSJ": "2021-03-08 14:17:46",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210308141427_750113",
                                        "SFJSK": 1
                                    }
                                }
                            },
                            {
                                "@医嘱ID": "149082523",
                                "YZID": 149082523,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 1.73,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "阿莫西林胶囊",
                                                "GG": "0.25g*24粒",
                                                "SL": 24,
                                                "DW": "粒",
                                                "DJ": ".0721"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0617724",
                                        "DJLX": 1,
                                        "JE": 1.73,
                                        "KDSJ": "2021-03-08 14:17:46",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210308141428_782365",
                                        "SFJSK": 1
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "DJH": "V0194036",
                    "HL": "普通",
                    "YYSJ": "2021-03-09 08:49:17",
                    "KDKS": "血液风湿免疫普通门诊",
                    "DJLX": 4,
                    "ZXZT": "完成就诊",
                    "SFYY": 0,
                    "JE": 5.5,
                    "YSID": 1022,
                    "YSXM": "李玉梅",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": {
                        "YZ": [
                            {
                                "@医嘱ID": "149115683",
                                "YZID": 149115683,
                                "YZLX": "检验",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "检验费",
                                        "JE": 30,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": [
                                                {
                                                    "MC": "尿液分析",
                                                    "GG": "",
                                                    "SL": 1,
                                                    "DW": "次",
                                                    "DJ": 10
                                                },
                                                {
                                                    "MC": "尿沉渣定量",
                                                    "GG": "",
                                                    "SL": 4,
                                                    "DW": "项",
                                                    "DJ": 5
                                                }
                                            ]
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0624917",
                                        "DJLX": 1,
                                        "JE": 30,
                                        "KDSJ": "2021-03-09 09:19:35",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210309091615_569856",
                                        "SFJSK": 1
                                    }
                                }
                            },
                            {
                                "@医嘱ID": "149143577",
                                "YZID": 149143577,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 1.73,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "阿莫西林胶囊",
                                                "GG": "0.25g*24粒",
                                                "SL": 24,
                                                "DW": "粒",
                                                "DJ": ".0721"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0630441",
                                        "DJLX": 1,
                                        "JE": 1.73,
                                        "KDSJ": "2021-03-09 15:03:17",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210309145956_971180",
                                        "SFJSK": 1
                                    }
                                }
                            },
                            {
                                "@医嘱ID": "149143587",
                                "YZID": 149143587,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 1.73,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "阿莫西林胶囊",
                                                "GG": "0.25g*24粒",
                                                "SL": 24,
                                                "DW": "粒",
                                                "DJ": ".0721"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0630450",
                                        "DJLX": 1,
                                        "JE": 1.73,
                                        "KDSJ": "2021-03-09 15:03:18",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210309145957_847366",
                                        "SFJSK": 1
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "DJH": "V0197653",
                    "HL": "专科",
                    "YYSJ": "2021-03-10 09:53:02",
                    "KDKS": "心血管内科普通门诊",
                    "DJLX": 4,
                    "ZXZT": "等待就诊",
                    "SFYY": 0,
                    "JE": 5.5,
                    "YSID": 1022,
                    "YSXM": "",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": ""
                },
                {
                    "DJH": "V0198953",
                    "HL": "专科",
                    "YYSJ": "2021-03-10 15:14:50",
                    "KDKS": "呼吸与危重症医学科普通门诊",
                    "DJLX": 4,
                    "ZXZT": "完成就诊",
                    "SFYY": 0,
                    "JE": 5.5,
                    "YSID": 4374,
                    "YSXM": "姜国松",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": {
                        "YZ": [
                            {
                                "@医嘱ID": "149204426",
                                "YZID": 149204426,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 1.73,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "阿莫西林胶囊",
                                                "GG": "0.25g*24粒",
                                                "SL": 24,
                                                "DW": "粒",
                                                "DJ": ".0721"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0642765",
                                        "DJLX": 1,
                                        "JE": 1.73,
                                        "KDSJ": "2021-03-10 15:44:30",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210310154058_776332",
                                        "SFJSK": 1
                                    }
                                }
                            },
                            {
                                "@医嘱ID": "149204432",
                                "YZID": 149204432,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 1.73,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "阿莫西林胶囊",
                                                "GG": "0.25g*24粒",
                                                "SL": 24,
                                                "DW": "粒",
                                                "DJ": ".0721"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0642774",
                                        "DJLX": 1,
                                        "JE": 1.73,
                                        "KDSJ": "2021-03-10 15:44:30",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210310154058_180966",
                                        "SFJSK": 1
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "DJH": "V0200887",
                    "HL": "普通",
                    "YYSJ": "2021-03-11 10:36:23",
                    "KDKS": "创伤外科(骨科)门诊",
                    "DJLX": 4,
                    "ZXZT": "完成就诊",
                    "SFYY": 0,
                    "JE": 5.5,
                    "YSID": 6025,
                    "YSXM": "许波",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": {
                        "YZ": [
                            {
                                "@医嘱ID": "149247388",
                                "YZID": 149247388,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 4.68,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "塞来昔布胶囊",
                                                "GG": "0.2g*12粒",
                                                "SL": 12,
                                                "DW": "粒",
                                                "DJ": ".39"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0652054",
                                        "DJLX": 1,
                                        "JE": 4.68,
                                        "KDSJ": "2021-03-11 15:02:27",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210311145845_963260",
                                        "SFJSK": 1
                                    }
                                }
                            },
                            {
                                "@医嘱ID": "149247409",
                                "YZID": 149247409,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 4.68,
                                        "ZFZT": 1,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "塞来昔布胶囊",
                                                "GG": "0.2g*12粒",
                                                "SL": 12,
                                                "DW": "粒",
                                                "DJ": ".39"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0652075",
                                        "DJLX": 1,
                                        "JE": 4.68,
                                        "KDSJ": "2021-03-11 15:02:27",
                                        "ZFZT": 1,
                                        "YTJE": 0,
                                        "JYLSH": "TFSSGZH_JFZT_210311145845_563785",
                                        "SFJSK": 1
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "DJH": "V0204287",
                    "HL": "普通",
                    "YYSJ": "2021-03-13 08:06:00",
                    "KDKS": "发热门诊",
                    "DJLX": 4,
                    "ZXZT": "正在就诊",
                    "SFYY": 0,
                    "JE": 5.5,
                    "YSID": 2553,
                    "YSXM": "胡代敏",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": ""
                },
                {
                    "DJH": "V0212948",
                    "HL": "专科",
                    "YYSJ": "2021-03-15 15:48:00",
                    "KDKS": "内分泌科普通门诊",
                    "DJLX": 4,
                    "ZXZT": "正在就诊",
                    "SFYY": 0,
                    "JE": 5.5,
                    "YSID": 1812,
                    "YSXM": "胡娅娜",
                    "ZFZT": 1,
                    "SFJSK": 1,
                    "YZLIST": {
                        "YZ": [
                            {
                                "@医嘱ID": "149464874",
                                "YZID": 149464874,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 1.73,
                                        "ZFZT": 0,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "阿莫西林胶囊",
                                                "GG": "0.25g*24粒",
                                                "SL": 24,
                                                "DW": "粒",
                                                "DJ": ".0721"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0694876",
                                        "DJLX": 1,
                                        "JE": 1.73,
                                        "KDSJ": "2021-03-15 16:26:53",
                                        "ZFZT": 0,
                                        "YTJE": 0,
                                        "JYLSH": "",
                                        "SFJSK": 0
                                    }
                                }
                            },
                            {
                                "@医嘱ID": "149465455",
                                "YZID": 149465455,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 11.09,
                                        "ZFZT": 0,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "连花清瘟胶囊",
                                                "GG": "0.35g*24粒",
                                                "SL": 24,
                                                "DW": "粒",
                                                "DJ": ".4621"
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0695020",
                                        "DJLX": 1,
                                        "JE": 11.09,
                                        "KDSJ": "2021-03-15 16:36:38",
                                        "ZFZT": 0,
                                        "YTJE": 0,
                                        "JYLSH": "",
                                        "SFJSK": 0
                                    }
                                }
                            },
                            {
                                "@医嘱ID": "149465464",
                                "YZID": 149465464,
                                "YZLX": "处方",
                                "YZMC": "",
                                "FMLIST": {
                                    "FM": {
                                        "MC": "西药费",
                                        "JE": 21.38,
                                        "ZFZT": 0,
                                        "MXLIST": {
                                            "MX": {
                                                "MC": "复合乳酸菌肠溶胶囊",
                                                "GG": "0.33g*12粒",
                                                "SL": 12,
                                                "DW": "粒",
                                                "DJ": 1.7817
                                            }
                                        }
                                    }
                                },
                                "DJLIST": {
                                    "DJ": {
                                        "DJH": "V0695034",
                                        "DJLX": 1,
                                        "JE": 21.38,
                                        "KDSJ": "2021-03-15 16:37:34",
                                        "ZFZT": 0,
                                        "YTJE": 0,
                                        "JYLSH": "",
                                        "SFJSK": 0
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}

let request = {
    "service": "Payment.PayReceipt.Query",
    "isPayed": false,
    "userId": "aaa",
    "PTname": "syu",
    "data": {
        "BRID": "123",
        "DAYS": "500",
        "JSKLB": "北京明康惠",
        "ZD": ""
    }
}

function getyzList(obj) {
    if (obj.state == 'F') {
        return {
            success: false,
            error: obj.ERROR_MSG
        }
    }
    if (!obj.data.GHLIST) {
        return {
            success: false,
            error: '找不到对应患者'
        }
    }
    let GHLIST = [];
    if (obj.data.GHLIST.GH.length) {
        GHLIST = obj.data.GHLIST.GH
    } else {
        GHLIST = [obj.data.GHLIST.GH];
    }
    let out = [];
    GHLIST.forEach(GH => {
        if (!GH.YZLIST.YZ) {
            return;
        }
        let YZLIST = [];
        if (GH.YZLIST.YZ.length) {
            YZLIST = GH.YZLIST.YZ
        } else {
            YZLIST = [GH.YZLIST.YZ];
        }
        YZLIST.forEach(YZ => {
            if (!YZ.FMLIST.FM) {
                return;
            }
            if (YZ.YZLX != '处方') {
                return;
            }
            let FMLIST = []
            if (YZ.FMLIST.FM.length) {
                FMLIST = YZ.FMLIST.FM;
            } else {
                FMLIST = [YZ.FMLIST.FM];
            }
            let payFlag = false;
            FMLIST.forEach(FM => {
                if (FM.ZFZT == '0') {
                    payFlag = true
                }
            });
            if (payFlag) {
                out.push({ yzId: YZ.YZID, departName: GH.KDKS, doctorName: GH.YSXM })
            }
        })
    })
    return out;

}

function payNumbers2222(obj, responsehead, responsestatus, requesthead, requestdata = {}, url) {
    const { cardNo, userId, PTname, isPayed } = requestdata;
    let zfFlage = isPayed ? 1 : 0;
    //获取所有的收费单据号
    if (obj.state == 'F') {
        return {
            success: 'false',
            error: obj.ERROR_MSG
        }
    }
    if (!obj.data.GHLIST) {
        return {
            success: 'false',
            error: '找不到对应患者'
        }
    }
    let GHLIST = [];
    if (obj.data.GHLIST.GH.length) {
        GHLIST = obj.data.GHLIST.GH
    } else {
        GHLIST = [obj.data.GHLIST.GH];
    }
    let out = [];
    GHLIST.forEach(GH => {
        if (!GH.YZLIST.YZ) {
            return;
        }
        if (GH.ZFZT == zfFlage) {
            let body = {
                DoctorName: GH.YSXM,
                Hpname: '昭通第一人民医院',
                RecipeDate: GH.YYSJ,
                DoctorId: GH.YSXM,
                CardNO: cardNo,
                Orgid: "416",
                Userid: userId,
                BillId: GH.DJH,
                TotalPayCost: GH.JE,
                DepartmentName: GH.KDKS,
                PTname: PTname,
                DepartmentId: GH.KSID
            }
            if (!out.find(o => o.DJH == GH.DJH)) {
                out.push({ DJH: GH.DJH, body: JSON.stringify(body) })
            }
        }
        let YZLIST = [];
        if (GH.YZLIST.YZ.length) {
            YZLIST = GH.YZLIST.YZ
        } else {
            YZLIST = [GH.YZLIST.YZ];
        }
        YZLIST.forEach(YZ => {
            if (!YZ.DJLIST.DJ) {
                return;
            }
            let DJLIST = [];
            if (YZ.DJLIST.DJ.length) {
                DJLIST = YZ.DJLIST.DJ;
            } else {
                DJLIST = [YZ.DJLIST.DJ];
            }
            DJLIST.forEach(DJ => {
                if (DJ.ZFZT == zfFlage) {
                    let body = {
                        DoctorName: GH.YSXM,
                        Hpname: '昭通第一人民医院',
                        RecipeDate: GH.YYSJ,
                        DoctorId: GH.YSXM,
                        CardNO: cardNo,
                        Orgid: "416",
                        Userid: userId,
                        BillId: DJ.DJH,
                        TotalPayCost: DJ.JE,
                        DepartmentName: GH.KDKS,
                        PTname: PTname,
                        DepartmentId: '',
                        YZMC: YZ.YZMC
                    }
                    if (!out.find(o => o.DJH == DJ.DJH)) {
                        out.push({ DJH: DJ.DJH, body: body })
                    }
                }
            })

        });
    })
    return out;
}


let ebody = {
    "service": "Guide.DrugAdvice.Query",
    "departName": "收拾收拾",
    "doctorName": "说的是",
    "data": {
        "YZID": "@yzId"
    }
}

let json2 = {
    "state": "T",
    "data": {
        "MXLIST": {
            "GROUP": {
                "YF": "冲服 每天三次",
                "LIST": {
                    "MX": {
                        "XM": "复方银花解毒颗粒",
                        "GG": "15g*9袋",
                        "SL": 9,
                        "DW": "袋",
                        "DJ": 9.0367,
                        "YL": "15g"
                    }
                }
            }
        }
    }
}

function sdsd(obj, responsehead, responsestatus, requesthead, requestdata, url) {
    let { departName, doctorName } = requestdata;
    if (obj.state == 'F') {
        return [];
    }
    obj = obj.data
    if (!obj.MXLIST.GROUP) {
        return [];
    }
    let list = [];
    if (obj.MXLIST.GROUP.length) {
        list = obj.MXLIST.GROUP
    } else {
        list = [obj.MXLIST.GROUP]
    }
    let out = [];
    list.forEach(o => {
        let mx = []
        if (!o.LIST.MX) {
            return;
        }
        if (o.LIST.MX.length) {
            mx = o.LIST.MX
        } else {
            mx = [o.LIST.MX]
        }
        mx.forEach(m => {
            out.push({ departName, doctorName, name: m.XM, uesage: o.YF, specification: m.GG, oneceDosage: m.YL, amount: m.SL, unit: m.DW })
        })
    })
    return out;
}

let out = sdsd(json2, 2, 3, 4, ebody)
console.log(out)




